build/classes/bank/req.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:req="http://api-v1.gen.mm.vodafone.com/mminterface/request">
    <soapenv:Header>
        <tns:RequestSOAPHeader xmlns:tns="http://www.huawei.com.cn/schema/common/v2_1">
            <tns:spId>35000001</tns:spId>
            <tns:spPassword>c5216e519a071d601bedd150f3fcd026</tns:spPassword>
            <tns:serviceId>35000001000009</tns:serviceId>
            <tns:timeStamp>20120101010101</tns:timeStamp>
        </tns:RequestSOAPHeader>
    </soapenv:Header>
    <soapenv:Body>
        <req:RequestMsg>
            <![CDATA[<?xml version="1.0" encoding="UTF-8"?>
            <request xmlns="http://api-v1.gen.mm.vodafone.com/mminterface/request">
                <Transaction>
                    <CommandID>CommandID0</CommandID>
                    <LanguageCode>LanguageCode0</LanguageCode>
                    <OriginatorConversationID>OriginatorConversationID0</OriginatorConversationID>
                    <ConversationID>ConversationID0</ConversationID>
                    <Remark>Remark0</Remark>
                    <EncryptedParameters>EncryptedParameters0</EncryptedParameters>
                    <Parameters>
                        <Parameter>
                            <Key>Key0</Key>
                            <Value>Value0</Value>
                        </Parameter>
                        <Parameter>                           
                            <Key>Key1</Key>
                            <Value>Value1</Value>
                        </Parameter>
                    </Parameters>
                    <ReferenceData>
                        <ReferenceItem>
                            <Key>QueueTimeoutURL</Key>
                            <Value>Value2</Value>
                        </ReferenceItem>
                        <ReferenceItem>
                            <Key>Key3</Key>
                            <Value>Value3</Value>
                        </ReferenceItem>
                    </ReferenceData>
                    <Timestamp>
                    </Timestamp>
                </Transaction>
                <Identity>
                    <Caller>
                        <CallerType>0</CallerType>
                        <ThirdPartyID>ThirdPartyID0</ThirdPartyID>
                        <Password>Password0</Password>
                        <CheckSum>CheckSum0</CheckSum>
                        <ResultURL>ResultURL0</ResultURL>
                    </Caller>
                    <Initiator>
                        <IdentifierType>1</IdentifierType>
                        <Identifier>Identifier0</Identifier>
                        <SecurityCredential>SecurityCredential0</SecurityCredential>
                        <ShortCode>
                        </ShortCode>
                    </Initiator>
                    <PrimartyParty>
                        <IdentifierType>1</IdentifierType>
                        <Identifier>Identifier1</Identifier>
                        <ShortCode>ShortCode0</ShortCode>
                    </PrimartyParty>
                    <ReceiverParty>
                        <IdentifierType>1</IdentifierType>
                        <Identifier>Identifier2</Identifier>
                        <ShortCode>ShortCode1</ShortCode>
                    </ReceiverParty>
                    <AccessDevice>
                        <IdentifierType>1</IdentifierType>
                        <Identifier>Identifier3</Identifier>
                    </AccessDevice>
                </Identity>
                <KeyOwner>0</KeyOwner>
            </request>]]>
        </req:RequestMsg>
    </soapenv:Body>
</soapenv:Envelope>